.svn/pristine/69/69307fa427c4a6766eb50d43eed698f4d1973a00.svn-base

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <GetQuoteMotor xmlns="http://MotorService/">
            <!-- Optional -->
            <objGetQuoteMotorETT>
                <LOGIN_ID>___insurer_integration_service_user___</LOGIN_ID>
                <DLR_INV_NO>___insurer_integration_agent_code___</DLR_INV_NO>
                <DLR_INV_DT>___invoice_date_1___</DLR_INV_DT>
                <PRODUCT_CODE>___product_id_1___</PRODUCT_CODE>
                <POLICY_TYPE>___vehicle_insurance_subtype_2___</POLICY_TYPE>
                <START_DATE>___policy_start_date_1___</START_DATE>
                <END_DATE>___policy_end_date_1___</END_DATE>
                <INSURED_NAME>___salutation___ ___first_name___ ___middle_name___ ___last_name___</INSURED_NAME>
                <ADDR_01>___communication_address_1___</ADDR_01>
                <ADDR_02>___communication_address_2___</ADDR_02>
                <ADDR_03>___communication_address_3___</ADDR_03>
                <CITY>___communication_city___</CITY>
                <STATE>___communication_state_code___</STATE>
                <PINCODE>___communication_pincode___</PINCODE>
                <COUNTRY>IND</COUNTRY>
                <EMAIL_ID>___email___</EMAIL_ID>
                <MOBILE_NO>___mobile___</MOBILE_NO>
                <TEL_NO/>
                <FAX_NO/>
                <ROAD_TRANSPORT_YN>0</ROAD_TRANSPORT_YN>
                <INSURED_KYC_VERIFIED>1</INSURED_KYC_VERIFIED>
                <MOU_ORG_MEM_ID/>
                <MOU_ORG_MEM_VALI/>
                <MANUF_VEHICLE_CODE>___dbmaster_insurer_vehicle_make_code___</MANUF_VEHICLE_CODE>
                <VEHICLE_CODE>___dbmaster_insurer_vehicle_code___</VEHICLE_CODE>
                <VEHICLE_TYPE_CODE>___vehicle_insurance_type___</VEHICLE_TYPE_CODE>
                <VEHICLE_CLASS_CODE>___vehicle_class_code___</VEHICLE_CLASS_CODE>
                <MANUF_CODE>___dbmaster_insurer_vehicle_make_code___</MANUF_CODE>
                <VEHICLE_MODEL_CODE>___dbmaster_insurer_vehicle_code___</VEHICLE_MODEL_CODE>
                <TYPE_OF_BODY_CODE>___vehicle_bodytype_1___</TYPE_OF_BODY_CODE>
                <VEHICLE_COLOR>___vehicle_color___</VEHICLE_COLOR>
                <VEHICLE_REG_NUMBER>___registration_no___</VEHICLE_REG_NUMBER>
                <FIRST_REG_DATE>___vehicle_registration_date_1___</FIRST_REG_DATE>
                <ENGINE_NUMBER>___engine_number___</ENGINE_NUMBER>
                <CHASSIS_NUMBER>___chassis_number___</CHASSIS_NUMBER>
                <VEH_IDV>___vehicle_expected_idv___</VEH_IDV>
                <CUBIC_CAPACITY>___dbmaster_insurer_vehicle_cubiccapacity___</CUBIC_CAPACITY>
                <THREEWHEELER_YN>0</THREEWHEELER_YN>
                <SEATING_CAPACITY>___dbmaster_insurer_vehicle_seatingcapacity___</SEATING_CAPACITY>
                <VEHICLE_GVW/>
                <NO_OF_DRIVERS/>
                <FUEL_TYPE_CODE>___vehicle_fueltype_1___</FUEL_TYPE_CODE>
                <RTO_CODE>___registration_no_1___-___registration_no_2___</RTO_CODE>
                <ZONE_CODE>___dbmaster_insurer_rto_zone_code___</ZONE_CODE>
                <GEO_EXT_CODE/>
                <VOLUNTARY_EXCESS>___voluntary_deductible_1___</VOLUNTARY_EXCESS>
                <MEMBER_OF_AAI>___is_aai_member_2___</MEMBER_OF_AAI>
                <ANTITHEFT_DEVICE_DESC>___is_antitheft_fit_2___</ANTITHEFT_DEVICE_DESC>
                <NON_ELEC_ACCESS_DESC></NON_ELEC_ACCESS_DESC>
                <NON_ELEC_ACCESS_VALUE>___non_electrical_accessory___</NON_ELEC_ACCESS_VALUE>
                <ELEC_ACCESS_DESC></ELEC_ACCESS_DESC>
                <ELEC_ACCESS_VALUE>___electrical_accessory___</ELEC_ACCESS_VALUE>
                <SIDE_CAR_ACCESS_DESC/>
                <SIDE_CARS_VALUE/>
                <TRAILER_DESC/>
                <TRAILER_VALUE/>
                <ARTI_TRAILER_DESC/>
                <ARTI_TRAILER_VALUE/>
                <PREV_YR_ICR/>
                <NCB_DECL_SUBMIT_YN>0</NCB_DECL_SUBMIT_YN>
                <LIMITED_TPPD_YN/>
                <RALLY_COVER_YN/>
                <RALLY_DAYS/>
                <NIL_DEP_YN>___addon_zero_dep_cover___</NIL_DEP_YN>
                <CNG_KIT_VALUE>___external_bifuel_value___</CNG_KIT_VALUE>
                <FIBRE_TANK_VALUE/>
                <ALT_CAR_BENEFIT/>
                <PERS_EFF_COVER/>
                <NO_OF_PA_OWNER_DRIVER>1</NO_OF_PA_OWNER_DRIVER>
                <NO_OF_PA_NAMED_PERSONS/>
                <PA_NAMED_PERSONS_SI/>
                <NO_OF_PA_UNNAMED_PERSONS>___dbmaster_insurer_vehicle_seatingcapacity___</NO_OF_PA_UNNAMED_PERSONS>
                <PA_UNNAMED_PERSONS_SI>___pa_unnamed_passenger_si___</PA_UNNAMED_PERSONS_SI>
                <NO_OF_PA_UNNAMED_HIRER/>
                <NO_OF_LL_EMPLOYEES/>
                <NO_OF_LL_PAID_DRIVER>___is_llpd_2___</NO_OF_LL_PAID_DRIVER>
                <NO_OF_LL_SOLDIERS/>
                <OTH_SINGLE_FUEL_CVR/>
                <IMP_CAR_WO_CUSTOMS_CVR/>
                <DRIVING_TUITION_EXT_CVR/>
                <NO_OF_COOLIES/>
                <NO_OF_CONDUCTORS/>
                <NO_OF_CLEANERS/>
                <TOWING_TYPE/>
                <NO_OF_TRAILERS_TOWED/>
                <NO_OF_NFPP_EMPL/>
                <NO_OF_NFPP_OTH_THAN_EMPL/>
                <DLR_PA_NOMINEE_NAME>___nominee_name___</DLR_PA_NOMINEE_NAME>
                <DLR_PA_NOMINEE_DOB>___nominee_birth_date___</DLR_PA_NOMINEE_DOB>
                <DLR_PA_NOMINEE_RELATION>___nominee_relation___</DLR_PA_NOMINEE_RELATION>
                <RETN_TO_INVOICE>___addon_invoice_price_cover___</RETN_TO_INVOICE>
                <HYPO_TYPE>___financial_agreement_type_2___</HYPO_TYPE>
                <HYPO_COMP_NAME>___financial_institute_name___</HYPO_COMP_NAME>
                <HYPO_COMP_ADDR_01/>
                <HYPO_COMP_ADDR_02/>
                <HYPO_COMP_ADDR_03/>
                <HYPO_COMP_CITY/>
                <HYPO_COMP_STATE/>
                <HYPO_COMP_PINCODE/>
                <PAYMENT_TYPE>OT</PAYMENT_TYPE><!--for testing use CD, for LIVE it will be OT-->
                <NCB_PERCENTAGE>___vehicle_ncb_current___</NCB_PERCENTAGE>
                <PREV_INSU_COMPANY>___dbmaster_previousinsurer_code___</PREV_INSU_COMPANY>
                <PREV_POL_NUMBER>___previous_policy_number___</PREV_POL_NUMBER>
                <PREV_POL_START_DATE>___pre_policy_start_date___</PREV_POL_START_DATE>
                <PREV_POL_END_DATE>___policy_expiry_date___</PREV_POL_END_DATE>
                <EXIS_POL_FM_OTHER_INSR>___exis_pol_fm_other_insr___</EXIS_POL_FM_OTHER_INSR>
                <IP_ADDRESS/>
                <MAC_ADDRESS/>
                <WIN_USER_ID/>
                <WIN_MACHINE_ID/>
                <DISCOUNT_PERC>___desc_prec___</DISCOUNT_PERC>
                <FLEX_01>___pa_paid_driver_si_3___</FLEX_01>
                <FLEX_02/>
                <FLEX_03>___vehicle_manf_year___</FLEX_03>
                <FLEX_04/>
                <FLEX_05/>
                <FLEX_06/>
                <FLEX_07/>
                <FLEX_08>___gst_no___</FLEX_08>
                <FLEX_09/>
                <FLEX_10/>
                <FLEX_12/>
                <FLEX_20>___is_pa_od___</FLEX_20>
                <FLEX_21>___addon_engine_protector_cover___</FLEX_21>
            </objGetQuoteMotorETT>
        </GetQuoteMotor>
    </Body>
</Envelope>